$(document).ready( function () {

//  $('#btn'); //селектор элемента 
$('.list-item:first').hover(function () {
  $(this).toggleClass('active');
}); //при навердении на первый элемент с этим классом вызываем колбек

$('.list-item:eq(0)').on('click', function () { 
  //фильтр eq получает конкретный по номеру элемент(нумерация js)
  $('.image:even').fadeToggle('slow'); //фильтр even - все четные элементы
  //в нашем случае идет с нулевого элемента и он как-бы четный, т.к. 1 - нечетный
}); 

$('.list-item:eq(4)').on('click', function () { //клик на 5 кнопку
  $('.image:odd').animate( //создаем анимация для нечетный элементов
    {
      opacity: 'toggle',  //вкл/выкл 
      height: 'toggle'
    }, 3000
  );
});
//библиотека грузит сайт, чистый JS - легко и круто
//1по сути эти селекторы - это перебор эл-ов, аналог forEach
//2 "суперфича" jq была - манипуляции с классом до прихода classList
//3 событие "on"
//4 $.ajax
//5 animate

}); 

document.addEventListener('DOMContentLoaded', function () {
  //Сравнение
  //document.querySelectorAll('.list-item').forEach(); //аналог
  //.classList
  //.addEventListener
  // fetch
  // анимация уже по средства встроенного animate (CSS3 стандарт анимации)
});


//ТЕХНОЛОГИИ ANGULAR react Vue.js
//SPA, отличие в том, что это одностраничное приложение должно рабоатать всё время
//без перезагрузки страницы


//ANGULAR
//- от Google, перспективы ОК
//- фреймворк(большое готовое и цельное решение, которое не нужно собирать из кусков
//в отличае от библиотекиь
//осн. на TypeScript - отдельный язык программирования, который после обр. ангуляр
//превращается в JS
//- самый тяжелый (143 кб) > react > мгу
//- Начало работы
//1. установка Node.js -> npm
//2. TypeScript изучение, но подойдет и JS, тк компилятор всё равно переводит в него
//3. Webpack - сборщик пакетов
//4. Шаблон проектирования MVC(model view controller)
//5. Angular


//React
//по трендам и вакансиям - тоже супер, создатель Facebook
//Начало работы
//1. установка Node.js -> npm
//2. Babel - переписывает код с ES6 -> ES5
//3. JSX - препроцессор JSX ("странная" вещь, аля более интеграции JS в HTML)
//4. React
//5. Webpack - сборщик пакетов


//Vue
//самый новичек, но быстрее всего развивающийся
// самый чисты и легкий инструмент
//Начало работы
//1. установка Node.js -> npm
//2. Babel - переписывает код с ES6 -> ES5
//3. Webpack - сборщик пакетов

//ИТОГИ выбора фрейма - 29:24 (тайминг)


